Repository: CleanCodeX/SRAM.Comparer
Catalog: Properties/Resources.*.resx
Languages: de, fr

# StatusTargetSramFileHasBeenBackedUpFilepathTemplate
source: Target SRAM file has been backed up as {0}.
de: Ziel-Datei wurde gesichert als {0}.
fr: Le fichier a été sauvegardé en tant que {0}.

# StatusTotalDiffBytesTemplate
source: Total: {0} bytes changed (outside save slot area)
de: Gesamt: {0} Bytes geändert (außerhalb des Speicherslots-Bereichs).
fr: Total : {0} octets modifiés (en dehors de la partie en cours).

# UnknownAreasOnly
source: Unknowns only
de: Nur unbekannte Bereiche
fr: Seulement les valeurs inconnues

# StatusSramFileHasBeenRestoredFromBackupTemplate
source: {0} has been restored from backup
de: {0} wurde aus Sicherung wiederhergestellt.
fr: {0} a été restauré à partir de la sauvegarde.

# StatusSramChangedBytesTemplate
source: {0} SRAM bytes changed
de: {0} Bytes geändert.
fr: {0} octets modifiés.

# StatusSetSingleSaveSlotMaxTemplate
source: Save slot {0} will be used.
de: Speicherslot {0} wird verwendet.
fr: Le partie {0} sera utilisée.

# StatusSetOffsetValueTemplate
source: Value at offset {0} is now {1}.
de: Der Wert von Offset {0} ist jetzt {1}.
fr: La valeur à la position {0} est de {1}.

# StatusOffsetWillBeUsedTemplate
source: Offset {0} will be used.
de: Offset {0} wird verwendet.
fr: Le décalage {0} sera utilisé.

# StatusOffsetValueWillBeUsedTemplate
source: Offset value {0} will be set.
de: Offset-Wert {0} wird gesetzt.
fr: La valeur à la position du décalage {0} sera modifiée.

# StatusNoSramBytesChanged
source: No SRAM bytes changed
de: Keine Bytes geändert.
fr: Aucun octet modifié dans le fichier.

# StatusNonSaveSlotUnknownsBytesTemplate
source: Unknown non-save slot area: {0} bytes changed
de: Unbekannter Nicht-Speicherslot Bereich: {0} Bytes geändert.
fr: Valeurs inconnues des autres parties : {0} octets modifiés.

# StatusNoAvailableOtherSramFiles
source: There are currently no other SRAM files available.
de: Es sind derzeit keine anderen SRAM-Dateien verfügbar.
fr: Il n'y a aucun autre fichier SRAM disponible.

# StatusGetOffsetValueTemplate
source: Value at offset {0} is {1}.
de: Der Wert bei Offset {0} ist aktuell {1}.
fr: La valeur au décalage {0} est désormais {1}.

source: All
de: Alle
fr: Toutes

# AppDescription
source: This tool compares unknown areas in SRAM.
de: Diese Anwendung vergleicht unbekannte Bereiche im SRAM.
fr: Cet outil fait une comparaison de fichiers SRAM.

source: Backup
de: Sicherung
fr: Sauvegarde

# ChangeShort
source: Change
de: Änderung
fr: Modification

# CmdGroupBackup
source: Backup
de: Sicherung
fr: Sauvegarde

# CmdGroupComparison
source: Comparison
de: Vergleich
fr: Comparaison

# CmdGroupDisplay
source: Display
de: Anzeige
fr: Affichage

# CmdMisc
source: Miscellaneous
de: Verschiedenes
fr: Autres

# CommandBackupComparisonSramFile
source: Back-up comparison SRAM file
de: Vergleichs-Datei sichern
fr: Sauvegarder le fichier de comparaison

# CommandBackupCurrentSramFile
source: Back-up current SRAM file
de: Aktuelle Datei sichern
fr: Sauvegarder le fichier en cours

# CommandCompareFile
source: Compare current SRAM file with comparison file
de: Vergleiche aktuelle Datei mit Vergleichs-Datei
fr: Comparer le fichier en cours avec celui de comparaison

# CommandListCommands
source: List commands
de: Befehle auflisten
fr: Liste des commandes

# CommandOffsetValue
source: Display offset value
de: Offset-Wert anzeigen
fr: Afficher le décalage en cours

# CommandSettings
source: Display settings
de: Einstellungen anzeigen
fr: Paramètres d'affichage

# CommandExportComparisonResult
source: Export current comparison result
de: Aktuelles Vergleichsergebnis exportieren
fr: Exporter le résultat de la comparaison en cours

source: Non-slot byte-by-byte comparison
de: Nicht-Speicherslot Byte-Für-Byte-Vergleich
fr: Comparer les zones en dehors de la partie en cours octet par octet :

source: Slot byte-by-byte comparison
de: Speicherslot Byte-Für-Byte-Vergleich
fr: Comparer les données de la partie en cours octet par octet

# CommandManual
source: Manual
de: Anleitung
fr: Manuel

# CommandOverwriteComparisonSramFile
source: Overwrite (or create) comparison file with current SRAM file
de: Überschreibe Vergleichs-Datei mt aktueller Datei
fr: Écraser le fichier de comparaison avec le fichier en cours

# CommandQuit
source: Quit
de: Beenden
fr: Quitter

# CommandRestoreComparisonSramFile
source: Restore comparison SRAM file from backup
de: Vergleichs-Datei aus Sicherung wiederherstellen
fr: Restaurer le fichier de comparaison à partir de la sauvegarde

# CommandRestoreCurrentSramFile
source: Restore current SRAM file from backup
de: Aktuelle Datei aus Sicherung wiederherstellen
fr: Restaurer le fichier en cours à partir de la sauvegarde

# CommandModifyOffsetValue
source: Modify (and save) offset value
de: Offset-Wert ändern und speichern
fr: Enregistrer la valeur du décalage

# CommandSetComparisonSramFileSaveSlot
source: Set comparison SRAM file's save slot
de: Speicherslot für Vergleichs-Datei festlegen
fr: Définir l'emplacement de jeu du fichier de comparaison

# CommandSetCurrentSrramFileSaveSlot
source: Set current SRAM file's save slot
de: Speicherslot für aktuelle Datei festlegen
fr: Définir l'emplacement de jeu du fichier en cours

# CommandSaveCurrentSramFileAsOtherFileName
source: Save current-SRAM file with other game file's name
de: Aktuelle Datei unter anderem Spielnamen speichern
fr: Enregistrer le fichier en cours avec le nom d'un autre fichier

# CommandWipeOutput
source: Wipe previous console output
de: Bisherige Konsolen-Ausgabe löschen
fr: Effacer la sortie de la console précédente

source: Comparison
de: Vergleich
fr: Comparaison

source: Comparison flags
de: Vergleichs-Flags
fr: Options de comparaison

# ComparisonShort
source: Comp
de: Vergl.

# CurrentShort
source: Curr
de: Akt.
fr: Courant

source: Current-SRAM file
de: Aktuelle Datei
fr: Fichier en cours

source: Current
de: Aktuell
fr: En cours

source: Comparison-SRAM file
de: Vergleichs-Datei
fr: Fichier de comparaison

# EnterCommand
source: Enter command and press enter.
de: Befehl eingeben und Eingabe drücken
fr: Entrez une commande et appuyez sur Entrée.

# EnterIndexOfSramFileToBeOverwrittenMaxIndexTemplate
source: Enter index (0 to {0}) of the SRAM file to be overwritten (any other key to cancel):
de: Index (0 bis {0}) der zu überschreibenden Datei eingeben (jede andere Taste um abzubrechen):
fr: Entrez le numéro (0 à {0}) du fichier à écraser ou appuyez sur n'importe quelle autre touche pour annuler :

# ErrorCannotOpenOutputFileTemplate
source: Cannot open output file "{0}" for writing
de: Kann die Datei "{0}" nicht zum Schreiben öffnen
fr: Impossible d'enregistrer le fichier de sortie "{0}"

# ErrorCommandNotImplementedTemplate
source: Command ({0}) needs to be implemented by caller.
de: Der Befehl (ow) muss vom Aufrufer implementiert werden.
fr: La commande (ow) n'est pas implémentée.

# ErrorComparisonFileDoesNotExist
source: The comparison file "{0}" has not been created yet. Please create one first.
de: Die Vergleichs-Datei "{0}" wurde noch nicht erstellt. Bitte zuerst eine erstellen.
fr: Le fichier de comparaison "{0}" n'a pas encore été créé. Veuillez d'abord en créer un.

# ErrorFileIsNotSrmFileTypeFilepathTemplate
source: {0} current file must have .srm file extension. Did you just forget to quote the path? Was: {1}
de: {0} aktuelle SRAM-Datei muss eine .srm Datei-Endung besitzen. Hast du vielleicht nur vergessen den Pfad in Anführungszeichen zu setzen? War: {1}

# ErrorInvalidIndex
source: Invalid index. Aborted.
de: Invalider Index. Abgebrochen.
fr: Numéro de partie invalide.

# ErrorMissingPathArguments
source: ERROR: The program needs to be started with at least the path to current SRAM file as a parameter. Drag 'n' drop can be used.
de: FEHLER: Die Anwendung muss mit mindestens dem Pfad zur aktuellen Speicher-Datei als Partameter gestartet werden. Drag 'n' Drop kann verwendet werden.
fr: ERREUR : le programme doit être démarré en indiquant au moins un fichier .srm en tant que paramètre. Vous pouvez aussi faire un drag and drop d'un fichier .srm sur ce .exe.

# ErrorNoValidCommandCmdTemplate
source: "{0}" is an unknown command. To list all available commands enter ({1}).
de: "{0}" ist ein unbekannter Befehl. Um alle verfügbaren Befehle anzuzeigen gib ({1}) ein.
fr: {0}" est une commande inconnue. Pour afficher la liste de toutes les commandes disponibles écrivez ({1}).

# ErrorOperationAborted
source: Operation aborted
de: Vorgang abgebrochen
fr: Opération annulée

# ErrorParamNameValueMissmatchTemplate
source: Parameter name value mismatch for: {0}
de: Parameter Name-Wert Nicht-Übereinstimmung für: {0}
fr: Incompatibilité de nom de paramètre pour {0}

source: Save slot
de: Speicherslot
fr: Partie

source: Save slot offset
de: Speicherslot-Offset
fr: Décalage dans la partie

# GetSaveSlotOffsetTemplate
source: Set Save slot {0} offset:
de: Speicherslot {0}-Offset setzen:
fr: Modifier le décalage dans cette partie {0} :

# GetSaveSlotOffsetValue
source: Set Save slot offset value:
de: Speicherslot-Offset-Wert setzen:
fr: Modifier la valeur du décalage dans cette partie :

source: New
de: Neu
fr: Nouveau

source: None
de: Keine
fr: Aucune

source: Old
de: Alt
fr: Ancien

source: Section
de: Bereich

source: Queued commands
de: Eingereihte Befehle
fr: Commandes en file d'attente

source: Same as current SRAM file' save slot
de: Gleicher Slot wie aktuelle Datei
fr: Identique à l'emplacement de la partie en cours

# SectionSaveSlotChangedTemplate
source: All (knowns + unknowns)
de: Alles (Bekannte und Unbekannte)
fr: Tout (valeurs connues et inconnues)

source: Export directory
de: Export-Verzeichnis
fr: Exporter le répertoire

source: Current SRAM filepath
de: Pfad für aktuelle Datei
fr: Chemin du fichier en cours

source: Comparison SRAM filepath
de: Pfad für Vergleichsdatei
fr: Comparaison du chemin du fichier

# CurrentSramFileSaveSlot
source: Save slot (current file)
de: Speicherslot (aktuelle Datei)
fr: Enregistrer la partie en cours

# ComparisonSramFileSaveSlot
source: Save slot (Comparison file)
de: Speicherslot (Vergleichsdatei)
fr: Partie du fichier de comparaison

source: game region
de: Spiel-Region
fr: Région du jeu

source: Settings
de: Einstellungen
fr: Réglages

source: Size
de: Größe
fr: Taille

# StartMessage
source: New here? For command list use ({0}|?) or ({1}) for manual
de: Neu hier? Für eine Liste aller Befehle gib ({0}|?) oder ({1}) für eine Bedienungsanleitung ein.
fr: Pour afficher la liste des commandes écrivez ({0} |?) ou ({1}).

# StatusBytesChangedTemplate
source: {0} bytes changed
de: {0} Bytes geändert.
fr: {0} octets modifiés.

# StatusModifiedSramFileHasBeenOverwrittenFilepathTemplate
source: Changed current SRAM File has been overwritten. File: {0}.
de: Die geänderte aktuelle Datei wurde überschrieben. Datei: {0}.
fr: Le fichier en cours qui a été modifié a été écrasé (fichier {0}).

# StatusModifiedSramFileHasBeenSavedAsFilepathTemplate
source: Changed current SRAM File has been saved as {0}.
de: Die geänderte Datei wurde gespeichert als: {0}.
fr: Le fichier en cours qui a été modifié a été enregistré (fichier {0}).

# PromtCreateNewFileInsteadOfOverwriting
source: Would you like to create a new SRAM file instead overwriting the current file? Type 1 for creating a new file (recommended) or type 2 to overwrite the existing file. In the latter case make sure to have a backup created before. 1 = new, 2 = overwrite, 0 = abort
de: Möchtest du eine neue Datei erstellen anstatt die aktuelle Datei zu überschreiben? Gib 1 ein um eine neue Datei zu erstellen (empfohlen) oder gib 2 ein um die existierende Datei zu überschreiben. In letzterem Fall stelle sicher, zuvor eine Sicherung gemacht zu haben. 1 = neu, 2 = überschreiben, 0 = abbrechen
fr: Souhaitez-vous créer un nouveau fichier au lieu d'écraser le fichier en cours? Tapez 1 pour créer un nouveau fichier (recommandé) ou tapez 2 pour écraser le fichier existant. Dans ce dernier cas assurez-vous d'avoir créé une sauvegarde. 1=nouveau, 2=écraser, 0=abandonner

# SetSaveSlotToCompareMaxTemplate
source: Set save slot (1-{0} or any other key for all save slots) to compare:
de: Setze Spielslot (1-{0} oder jede andere Taste für alle Speicherslots) zum vergleichen:
fr: Définir la partie à comparer (1- {0} ou appuyez sur n'importe quelle autre touche pour sélectionner toutes les parties) :

# SetSingleSaveSlotMaxTemplate
source: Set save slot (1-{0}):
de: Speicherslot (1-{0}) setzen:
fr: Définir la partie (1- {0}) :

# SettinComparegNonGameBuffer
source: Compare non-save slot area
de: Vergleiche den Nicht-Speicherslot-Bereich
fr: Comparer les zones en dehors de la partie en cours

# SettingCompareWholeGameBuffer
source: Compare whole save slot area
de: Vergleiche den gesamten Speicherslot-Bereich
fr: Comparer la partie en cours en entier

# StatusCurrentSramFileHasBeenBackedUpTemplate
source: {0} has been backed-up
de: {0} wurde gesichert.
fr: {0} a été sauvegardé.

# StatusCurrentComparisonExportedFilepathTemplate
source: Current comparison exported to "{0}"
de: Aktueller Vergleich exportiert nach "{0}".
fr: Comparaison en cours enregistrée dans le fichier "{0}".

# StatusCurrentSramFileHasBeenSaved
source: Current SRAM file has been saved as comparison SRAM file
de: Die aktuelle Datei wurde als Vergleichs-Datei gespeichert.
fr: Le fichier en cours a été enregistré en tant que fichier de comparaison.

# StatusCurrentSramHasBeenSavedAsFilepathTemplate
source: Current SRAM file has been copied as {0}.
de: Die aktuelle Datei wurde kopiert als {0}.
fr: Le fichier en cours a été copié (fichier {0}).

# StatusSaveSlotChangedBytesTemplate
source: All (knowns + unknowns): {0} bytes changed
de: Alles (Bekannte + Unbekannte): {0} Bytes geändert.
fr: Tout (valeurs connues et inconnues) : {0} octets modifiés.

# StatusUnknownsChangedBytesTemplate
source: Unknowns only: {0} bytes changed
de: Nur Unbekannte: {0} Bytes geändert.
fr: Valeurs inconnues uniquement : {0} octets modifiés.

# StatusSingleSaveSlotWillBeComparedTemplate
source: Only save slot {0} will be compared.
de: Nur der Speicherslot {0} wird verglichen.
fr: Seule la partie en cours {0} sera comparée.

source: Colorize output
de: Ausgabe einfärben
fr: Résultat avec couleurs

# StatusAllSaveSlotsWillBeCompared
source: All save slots will be compared.
de: Alle Speicherslots werden verglichen.
fr: Toutes les parties seront comparées.

# SectionNonSaveSlotUnknowns
source: Non-save slot unknowns
de: Unbekannter nicht-Speicherslot-Bereich
fr: Valeurs inconnues des autres parties

# ErrorComparisonSramSaveSlotSetButNotCurrentSramSaveSlot
source: Save slot for comparison SRAM file can only be set if current SRAM file's save slot is set first.
de: Der Vergleichs-Datei Speicherslot kann erst gesetzt werden, nachdem der Speicherslot der aktuellen Datei festgelegt wurde.
fr: L'emplacement de comparaison dans le fichier ne peut être défini que si l'emplacement d'enregistrement en cours dans le fichier a été défini en premier.

# ErrorCompSaveSlotFileIsNotCompFileTypeFilepathTemplate
source: {0} comparison file must have .comp file extension. Did you just forget to quote the path? Was: {1}
de: {0} Vergleichs SRAM-Datei muss eine .comp Datei-Endung besitzen. Hast du vielleicht nur vergessen den Pfad in Anführungszeichen zu setzen? War: {1}

# CommandSlotByteByBytesComparison
source: Add slot byte-by-byte comparison
de: Speicherslot Byte-für-Byte vergleichen
fr: Comparer toutes les parties octet par octet

# CommandNonSlotByteByByteComparison
source: Add non-slot byte-by-byte comparison
de: Nicht-Speicherslot-Bereich Byte-für-Byte vergleichen
fr: Comparer les autres parties octet par octet

source: bytes
fr: octets

source: Offset
fr: Décalage

source: SRAM offset
fr: Décalage SRAM
